In [3]:
import pandas as pd
import numpy as np

import matplotlib.pyplot as plt
%matplotlib inline

## Load Test Data

In [5]:
test_data_frame=pd.read_csv('datasets/test.csv')
print(test_data_frame.shape)

(418, 11)

## Load Train Data

In [6]:
train_data_frame=pd.read_csv('datasets/train.csv')
print(train_data_frame.shape)

(891, 12)

In [7]:
train_data_frame.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [8]:
test_data_frame[200:205]

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
200,1092,3,"Murphy, Miss. Nora",female,NaN,0,0,36568,15.500,NaN,Q
201,1093,3,"Danbom, Master. Gilbert Sigvard Emanuel",male,0.33,0,2,347080,14.400,NaN,S
202,1094,1,"Astor, Col. John Jacob",male,47.00,1,0,PC 17757,227.525,C62 C64,C
203,1095,2,"Quick, Miss. Winifred Vera",female,8.00,1,1,26360,26.000,NaN,S
204,1096,2,"Andrew, Mr. Frank Thomas",male,25.00,0,0,C.A. 34050,10.500,NaN,S

# Remove 0 or Null Value or Missing Value From Dataset

In [9]:
print("# rows in dataframe {0}".format(len(train_data_frame)))
print("# rows missing Cabin: {0}".format(len(train_data_frame.loc[train_data_frame['Cabin'] == 0])))
print("# rows missing Age: {0}".format(len(train_data_frame.loc[train_data_frame['Age'] >80])))

# rows in dataframe 891
# rows missing Cabin: 0
# rows missing Age: 0

# Survival Ratio

In [10]:
survived = 0.0
died = 0.0
for d in train_data_frame['Survived']:
    if d==0:
        died+=1
    else:
        survived+=1

print(survived,died)
print(survived+died)
survived_ratio = survived/(survived+died)*100
died_ratio = died/(survived+died)*100
print ("Number of survived Cases:{0} survived_ratio:{1:2.2f}%".format(int(survived), survived_ratio))
print ("Number of died Cases: {0} died_ratio:{1:2.2f}%".format(int(died), died_ratio))

342.0 549.0
891.0
Number of survived Cases:342 survived_ratio:38.38%
Number of died Cases: 549 died_ratio:61.62%